#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖Success! The configuration is valid.


#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/honestbank/terraform-aws-sftp/runs/run-QYUSLvLjyrum8Hhp

Waiting for the plan to start...

Terraform v1.0.7
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.sftp.data.aws_iam_policy_document.transfer_server_readonly_policy_document will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "transfer_server_readonly_policy_document"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetBucketLocation",
              + "s3:GetObject",
              + "s3:GetObjectVersion",
              + "s3:ListBucket",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
        }
    }

  # module.sftp.data.aws_iam_policy_document.transfer_server_write_policy_document will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "transfer_server_write_policy_document"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "s3:DeleteObject",
              + "s3:DeleteObjectVersion",
              + "s3:GetBucketLocation",
              + "s3:GetObject",
              + "s3:GetObjectVersion",
              + "s3:ListBucket",
              + "s3:PutObject",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
        }
    }

  # module.sftp.aws_iam_role.transfer_server_readonly_role will be created
  + resource "aws_iam_role" "transfer_server_readonly_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "transfer.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "lab-transfer-server-readonly-role"
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.sftp.aws_iam_role.transfer_server_role will be created
  + resource "aws_iam_role" "transfer_server_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "transfer.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "lab-transfer-server-transfer_server_role"
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.sftp.aws_iam_role.transfer_server_write_role will be created
  + resource "aws_iam_role" "transfer_server_write_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "transfer.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "lab-transfer-server-write-role"
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.sftp.aws_iam_role_policy.transfer_server_readonly_policy will be created
  + resource "aws_iam_role_policy" "transfer_server_readonly_policy" {
      + id     = (known after apply)
      + name   = "lab-transfer-server-transfer_server_readonly_policy"
      + policy = (known after apply)
      + role   = "lab-transfer-server-readonly-role"
    }

  # module.sftp.aws_iam_role_policy.transfer_server_to_cloudwatch_policy will be created
  + resource "aws_iam_role_policy" "transfer_server_to_cloudwatch_policy" {
      + id     = (known after apply)
      + name   = "lab-transfer-server-transfer_server_to_cloudwatch_policy"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:PutLogEvents",
                          + "logs:CreateLogStream",
                          + "logs:CreateLogGroup",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role   = "lab-transfer-server-transfer_server_role"
    }

  # module.sftp.aws_iam_role_policy.transfer_server_write_policy will be created
  + resource "aws_iam_role_policy" "transfer_server_write_policy" {
      + id     = (known after apply)
      + name   = "lab-transfer-server-transfer_server_write_policy"
      + policy = (known after apply)
      + role   = "lab-transfer-server-write-role"
    }

  # module.sftp.aws_s3_bucket.transfer_server_bucket will be created
  + resource "aws_s3_bucket" "transfer_server_bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = (known after apply)
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + versioning {
          + enabled    = true
          + mfa_delete = false
        }
    }

  # module.sftp.aws_transfer_server.transfer_server will be created
  + resource "aws_transfer_server" "transfer_server" {
      + arn                    = (known after apply)
      + domain                 = "S3"
      + endpoint               = (known after apply)
      + endpoint_type          = "PUBLIC"
      + force_destroy          = false
      + host_key_fingerprint   = (known after apply)
      + id                     = (known after apply)
      + identity_provider_type = "SERVICE_MANAGED"
      + logging_role           = (known after apply)
      + protocols              = [
          + "SFTP",
        ]
      + security_policy_name   = "TransferSecurityPolicy-2018-11"
      + tags                   = {
          + "type" = "Managed by Terraform"
        }
      + tags_all               = {
          + "type" = "Managed by Terraform"
        }
    }

  # module.sftp.aws_transfer_ssh_key.transfer_server_write_ssh_keys[0] will be created
  + resource "aws_transfer_ssh_key" "transfer_server_write_ssh_keys" {
      + body      = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQDOt6TLtVqAZ2cb07xmmatfDbThVu3lEP8i0wnhZ0/t11YRARvoLQf31LaxI20M6oSRJNLpuSyl2jDJ35/BpltdAsSC7eGumxSev23dr5l3MSKNEnZzrAbBPtKpQKALqsXuG9d6Xf9N4pMTn0LjswCKcnHAiO+DoqoX8NS2sT7znOzA6/IxXiYUsNsOiI2pyM9Z6z+m+ukOvZyjuF5bdLMjyTwCtlCOZ1XpD4c+bu/uJsWECKp14hn23QJtGo/KebpY4oUn/qYo1WC+0wVp2AQsDeNcojiTsU9fBADM0SzVp5OR0r2tbBgxXrB2adApj+YpBtaOTDt3E2j32otsYGTF0snf974eLsumZ5TI3aaVKH1NgqhTjRyifmI4h65/h3qVlggNV3ywAzSHtn79FEEXaJDiOFLRSsMTpaUkM5CjiJR5/PxkJ7LxPMECzET+juSosWfrc2Ttivke9HhIi6FJBnNIOnuvUHU/EEWA55vnqlVnZMoCVPPJd0BvbTACXtM="
      + id        = (known after apply)
      + server_id = (known after apply)
      + user_name = "example01-user"
    }

  # module.sftp.aws_transfer_user.transfer_server_write_user[0] will be created
  + resource "aws_transfer_user" "transfer_server_write_user" {
      + arn                 = (known after apply)
      + home_directory_type = "LOGICAL"
      + id                  = (known after apply)
      + role                = (known after apply)
      + server_id           = (known after apply)
      + tags_all            = (known after apply)
      + user_name           = "example01-user"

      + home_directory_mappings {
          + entry  = "/"
          + target = (known after apply)
        }
    }

  # module.sftp.random_id.aws_s3_bucket_transfer_server will be created
  + resource "random_id" "aws_s3_bucket_transfer_server" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 8
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

Plan: 11 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + transfer_server_arn      = (known after apply)
  + transfer_server_endpoint = (known after apply)
  + transfer_server_id       = (known after apply)
```

</details>

*Pusher: @pgcloud, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform GitHub Actions`*